{
  "_name_or_path": "cmarkea/detr-layout-detection",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetrForSegmentation"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "backbone_config": null,
  "backbone_kwargs": {
    "in_chans": 3,
    "out_indices": [
      1,
      2,
      3,
      4
    ]
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "classifier_dropout": 0.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "Caption",
    "1": "Footnote",
    "2": "Formula",
    "3": "List-item",
    "4": "Page-footer",
    "5": "Page-header",
    "6": "Picture",
    "7": "Section-header",
    "8": "Table",
    "9": "Text",
    "10": "Title"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Caption": 0,
    "Footnote": 1,
    "Formula": 2,
    "List-item": 3,
    "Page-footer": 4,
    "Page-header": 5,
    "Picture": 6,
    "Section-header": 7,
    "Table": 8,
    "Text": 9,
    "Title": 10
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 100,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.44.0",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
